In [1]:
!python -m pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in c:\users\light\appdata\local\packages\pythonsoftwarefoundation.python.3.12_qbz5n2kfra8p0\localcache\local-packages\python312\site-packages (2.3.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\light\appdata\local\packages\pythonsoftwarefoundation.python.3.12_qbz5n2kfra8p0\localcache\local-packages\python312\site-packages (from pandas) (2.4.1)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\light\appdata\local\packages\pythonsoftwarefoundation.python.3.12_qbz5n2kfra8p0\localcache\local-packages\python312\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\light\appdata\local\packages\pythonsoftwarefoundation.python.3.12_qbz5n2kfra8p0\localcache\local-packages\python312\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\light\appdata\local\packages\pythonsoftwarefoundation.python.3.12_qbz5n2kfra8p0\localcache\local-packages\python312\site-packages (from pandas) (2025.3)
Requirement already satisfied: six>=1.5 in c:\users\light\appdata\local\packages\pythonsoftwarefoundation.python.3.12_qbz5n2kfra8p0\localcache\local-packages\python312\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

[notice] A new release of pip is available: 25.0.1 -> 25.3
[notice] To update, run: C:\Users\Light\AppData\Local\Microsoft\WindowsApps\PythonSoftwareFoundation.Python.3.12_qbz5n2kfra8p0\python.exe -m pip install --upgrade pip

In [2]:
import pandas as pd

In [3]:
data = {
    "Name": ["Alex", "Maria", "John", "Sara", "Tom"],
    "Age": [19, 21, 22, 20, 23],
    "Score": [75, 88, 92, 81, 69]
}

df = pd.DataFrame(data)
df

    Name  Age  Score
0   Alex   19     75
1  Maria   21     88
2   John   22     92
3   Sara   20     81
4    Tom   23     69

In [4]:
df.head(3)

    Name  Age  Score
0   Alex   19     75
1  Maria   21     88
2   John   22     92

In [5]:
df.describe()

             Age      Score
count   5.000000   5.000000
mean   21.000000  81.000000
std     1.581139   9.354143
min    19.000000  69.000000
25%    20.000000  75.000000
50%    21.000000  81.000000
75%    22.000000  88.000000
max    23.000000  92.000000

In [6]:
df["Score"].mean()

np.float64(81.0)

In [7]:
df[df["Age"] > 20]

    Name  Age  Score
1  Maria   21     88
2   John   22     92
4    Tom   23     69

In [8]:
df[df["Score"] > 80]

    Name  Age  Score
1  Maria   21     88
2   John   22     92
3   Sara   20     81